%% -*- coding: latin-1 -*-
%% Author: caochuncheng2002@gmail.com
%% Created: 2013-7-15
%% Description: 日志类型字典信息，此文件不可以修改，由log.xml生成


-module(cfg_log_dict).

-export([
         get_log_dict/0
        ]).
%% 获取信息字典信息
%% 返回 json数据
%% [{"id":320000,"desc":"商店购买获得","type":3},...].
get_log_dict() ->
    "[{\"id\":110000,\"name\":\"充值获得\",\"type\":1},
      {\"id\":110001,\"name\":\"后台充值获得\",\"type\":1},
      {\"id\":110002,\"name\":\"后台充值获得\",\"type\":1},
      {\"id\":110003,\"name\":\"使用物品获得\",\"type\":1},
      {\"id\":120000,\"name\":\"商店购买失去\",\"type\":1},
      {\"id\":120001,\"name\":\"立即完成任务失去\",\"type\":1},
      {\"id\":120002,\"name\":\"完成并提交任务失去\",\"type\":1},
      {\"id\":120003,\"name\":\"刷新任务品质失去\",\"type\":1},
      {\"id\":120004,\"name\":\"委托任务失去\",\"type\":1},
      {\"id\":120005,\"name\":\"委托加速失去\",\"type\":1},
      {\"id\":120006,\"name\":\"打开礼包失去\",\"type\":1},
      {\"id\":120007,\"name\":\"扩展仓库格子失去\",\"type\":1},
      {\"id\":120008,\"name\":\"发送信件失去\",\"type\":1},
      {\"id\":120009,\"name\":\"创建军团失去\",\"type\":1},
      {\"id\":210001,\"name\":\"后台充值获得\",\"type\":2},
      {\"id\":210002,\"name\":\"使用物品获得\",\"type\":2},
      {\"id\":210003,\"name\":\"完成任务获得\",\"type\":2},
      {\"id\":220000,\"name\":\"商店购买失去\",\"type\":2},
      {\"id\":220001,\"name\":\"立即完成任务失去\",\"type\":2},
      {\"id\":220002,\"name\":\"完成并提交任务失去\",\"type\":2},
      {\"id\":220003,\"name\":\"创建帮派失去\",\"type\":2},
      {\"id\":310000,\"name\":\"商店购买获得\",\"type\":3},
      {\"id\":310001,\"name\":\"信件附件获得\",\"type\":3},
      {\"id\":310002,\"name\":\"任务获得\",\"type\":3},
      {\"id\":310003,\"name\":\"开礼包获得\",\"type\":3},
      {\"id\":320000,\"name\":\"仓库销毁物品失去\",\"type\":3},
      {\"id\":320001,\"name\":\"出售系统物品失去\",\"type\":3},
      {\"id\":320002,\"name\":\"删除信件失去\",\"type\":3},
      {\"id\":320003,\"name\":\"发送信件失去\",\"type\":3},
      {\"id\":320004,\"name\":\"使用物品失去\",\"type\":3},
      {\"id\":410000,\"name\":\"出售物品获得\",\"type\":4},
      {\"id\":410001,\"name\":\"后台充值获得\",\"type\":4},
      {\"id\":410002,\"name\":\"任务奖励获得\",\"type\":4},
      {\"id\":410003,\"name\":\"使用物品获得\",\"type\":4},
      {\"id\":420000,\"name\":\"道具回购失去\",\"type\":4},
      {\"id\":420001,\"name\":\"任务刷新品质失去\",\"type\":4},
      {\"id\":510004,\"name\":\"使用道具获得军功\",\"type\":5},
      {\"id\":510008,\"name\":\"任务奖励获得军功\",\"type\":5},
      {\"id\":510018,\"name\":\"在线奖励获得军功\",\"type\":5},
      {\"id\":510022,\"name\":\"活跃度励获得军功\",\"type\":5},
      {\"id\":510027,\"name\":\"使用道具获得武将碎片\",\"type\":5},
      {\"id\":510028,\"name\":\"招募将领获得武将碎片\",\"type\":5},
      {\"id\":520000,\"name\":\"聊天消耗活力值\",\"type\":5},
      {\"id\":520004,\"name\":\"兑换消耗军功\",\"type\":5},
      {\"id\":520005,\"name\":\"兑换消耗功勋\",\"type\":5},
      {\"id\":520013,\"name\":\"交换将领消耗武将碎片\",\"type\":5}]".
