%% -----------------------
%% @autor wangweibiao
%% ------------------------
-module(demon_grab_name).
-export([
		get_boy1_2/0,
		get_boy3/0,
		get_boy4/0,
		get_girl1_2/0,
		get_girl3/0,
		get_girl4/0
		]).


get_boy1_2() ->
	{50, 
		["泰勒","弗恩","弗农","文森","沃伦","威廉","亚弗","列得","火眼","杰农","艾伦","奥斯","阿尔","亚维","亚斯","安得","安其","安格","艾尔","尼奥","阿奇","火焰","柏德","亚力","亚尔","亚曼","阿姆","阿诺","亚瑟","艾文","亚撒","亚希","伯恩","亚特","伍德","奥布","奥格","奥古","斯汀","艾里","拜德","柏得","班克","罗特","巴德","巴罗","巴特","巴伦","巴里","巴萨","罗穆","巴顿","巴泽","比其","贝克","班比","班尼","迪克","班杰","班奈","班森","柏格","格吉","格纳","伯尼","伯特","柏特","莱姆","维斯","比尔","凯文","金姆","科克","凯尔","蓝伯","蓝斯","劳瑞","蓝翼","列夫","伦恩","蓝侬","铁拳","伦纳","利奥","波德","勒斯","斯特","李维","劳伦","赖昂","内尔","陆斯","路德","赖尔","林顿","林恩","麦基","麦肯","曼德","马斯","马里","马克","马伦","玛希","马丁","马文","马特","马休","摩里","米兰","麦斯","威尔","马勒","第兹","赤发","莫林","铁甲","米契","密克","麦克","莫尔","摩根","摩卡"]}.
get_boy3() ->
	{60, 
		["夏","奇","路","本","约","维","多","洛","龙","杜","眀","伯","格","乔","卡","纳","塔","吉","安","布","拉","希","埃","星","狄","生","圣","恒","王","奥","真","历","山","地","烈","班","奈","马","迈","麦","斐","丹","利","毕","保","邦","松","彼","菲","比","昆","穆","莱","兰","列","雷","理","查","克","得","森","昂","伊","赖","姆","萨","塞","尔","考","肖","德","尼","恩","所","帕","红","派","坦","新","月","亚","可","歌","蒂","帝","汤","米","西","莫","里","伦","特","图","文","斯","罗","蒙","顿","北","南"]}.
get_boy4() ->
	{100, 
		["亚伦","亚伯","亚当","艾里","托尼","艾伦","艾伯","安德","安迪","安格","安东","亚瑟","尤莱","本恩","本森","比尔","鲍伯","布兰","布伦","布鲁","布斯","卡尔","凯里","卡帕","查尔","采尼","科林","科莫","丹尼","德克","唐纳","道斯","大卫","史诗","埃德","爱德","艾德","艾特","埃尔","埃里","埃文","弗克","富克","弗德","加利","加比","加菲","加里","加文","乔治","基诺","格林","哈里","雨果","汉克","霍华","亨利","伊格","伍兹","伊凡","艾克","巨焰","杰克","詹姆","詹森","杰弗","杰罗","杰瑞","杰西","吉姆","吉米","乔斯","约翰","约瑟","贾汀","凯斯","肯恩","肯尼","凯文","兰斯","拉里","劳伦","利安","李龙","雷欧","雷德","利奥","波特","之拳","劳瑞","劳恩","卢克","马库","马西","马克","马科","马尔","马丁","摩西","摩菲","莫雷","麦伦","纳特","奈登","奈宝","尼尔","纽曼","尼克","勒斯","神座","安贝","炎帝","爱勒","贝拉","亚特","兰特","汤姆","麦斯","米路","门罗","曼特","摩帝","摩顿"]}.
get_girl1_2() ->
	{50, 
		["露丝","维丝","绮丽","克辛","梅莉","梅米","梅甘","梅琳","梅利","梅莎","洛蒂","默西","迪丝","梅瑞","狄斯","米歇","米莉","米兰","米里","亚姆","米娅","茉莉","莫尼","南茜","娜莉","娜莎","妮可","绮莉","基塔","尼娜","奥琳","夏洛","奥帕","帕梅","丝特","保拉","波琳","珀尔","帕姬","菲洛","米娜","菲比","菲丽","波莉","普里","西拉","昆蒂","莎莉","雷切","丽贝","莉亚","瑞娜","丽塔","罗丝","洛克","诗者","咏唱","萨布","丽娜","桑德","萨莎","桑迪","莎拉","塞尔","塞西","塞琳","塞丽","莎伦","希拉","雪莉","雪丽","吟歌","西尔","维亚","索尼","凯丝","塔茜","特拉","斯蒂","芬妮","苏拉","萨妮","苏珊","凯瑟","玛拉","苔米","苔丝","特莉","卡洛","蒂妮","蒂娜","蕾西","妮莎","维姬","维多","利亚","布丽","薇安","旺达","温蒂","温妮","尤达","卡萝","伊薇","伊温","佐伊","艾比","卡拉","艾达","爱拉","爱得","莱德","芙拉","爱莎","爱葛","妮丝","爱尔","柏塔","坎蒂","莉克","希亚","爱丽","爱玛"]}.
get_girl3() ->
	{60, 
		["瑟","梅","咪","尼","帝","舞","安","贝","勒","塔","萨","薇","翠","盖","典","萝","芭","辛","琪","碧","红","柏","汀","尤","百","白","纱","康","坦","柯","织","可","里","克","斯","笆","圣","林","音","温","尔","汉","海","婷","赫","米","伦","恩","亚","多","爱","雅","英","洛","詹","丝","琳","凯","西","卡","娜","茜","琼","蒂","瑞","莫","乔","朱","娅","莲","达","箩","莉","罗","汐","兹","蜜","兰","戴","布","邦","蓝","姬","曼","迪","格","丽","翼","芙","鲁","玛","路","依","露","雨","妮","拉","莱","东","冬"]}.
get_girl4() ->
	{100, 
		["米露","琳娜","艾比","艾达","阿德","莱德","艾德","亚桑","格温","艾丽","艾莎","多琳","爱丽","艾琳","汉娜","曼达","艾美","安伯","纳斯","塔娅","安德","莉亚","安吉","莉娜","安拉","安妮","安尼","海娜","里尔","海伦","维娃","贝芙","贝亚","阿特","丽斯","贝基","贝蒂","兰奇","邦妮","伦达","卡米","莰蒂","瑞娜","卡门","凯罗","卡琳","凯丽","凯莉","卡桑","德拉","凯西","凯瑟","凯茜","切西","沙琳","夏洛","切莉","雪莉","克莉","赫柏","蒂娜","克里","斯蒂","辛迪","海蒂","迪娅","克莱","克劳","英格","康妮","康斯","坦斯","科拉","科瑞","科特","戴茜","芙妮","达茜","黛比","黛拉","黛布","黛米","黛安","黛娜","德洛","丽丝","堂娜","瑞丝","伊迪","伊萨","伊莱","凯琳","伊莎","埃拉","爱伦","艾莉","艾瑞","艾米","艾玛","伊妮","埃莎","埃莉","爱斯","特尔","爱丝","杜拉","伊娃","伊芙","芬妮","菲奥","弗郎","西丝","弗雷","德卡","弗达","吉娜","吉莉","格拉","蒂丝","格罗","瑞娅","格瑞","格塔"]}.
