
%% -----------------------
%% 宠物潜力提升成功率数据
%% @autor wangweibiao
%% ------------------------
-module(pet_asc_ratio).
-export([get_val/1,
		get_all_step/0,
		get_all_slot/0,
		get_all_ratio_step/0,
		get_all_lev/0,
		get_all_cost/0
		]).
		
%%所有的技能槽个数		
get_all_slot() ->
[2,3,4,5,6,7,8,9,10].

%%技能槽所对应的阶
get_all_step() ->
[0,100,200,300,400,500,600,700,800].

%% 潜能阶级对应的等级阶
get_all_lev() ->
[0,10,20,30,40,50,55,56,57].

%% 潜能阶级对应的潜能石
get_all_cost() ->
[3,7,10,14,30,80,120,180,0].


%%区分成功率的阶
get_all_ratio_step() ->
[10,20,30,40,50,60,70,80,90,100,110,120,130,140,150,160,170,180,190,200,210,220,230,240,250,260,270,280,290,300,310,320,330,340,350,360,370,380,390,400,410,420,430,440,450,460,470,480,490,500,510,520,530,540,550,560,570,580,590,600,610,620,630,640,650,660,670,680,690,700,710,720,730,740,750,760,770,780,790,800].

%%各个阶对应的成功率
get_val(10) ->
	100;
get_val(20) ->
	100;
get_val(30) ->
	100;
get_val(40) ->
	100;
get_val(50) ->
	90;
get_val(60) ->
	80;
get_val(70) ->
	73;
get_val(80) ->
	66;
get_val(90) ->
	61;
get_val(100) ->
	57;
get_val(110) ->
	100;
get_val(120) ->
	100;
get_val(130) ->
	100;
get_val(140) ->
	100;
get_val(150) ->
	96;
get_val(160) ->
	91;
get_val(170) ->
	86;
get_val(180) ->
	82;
get_val(190) ->
	79;
get_val(200) ->
	75;
get_val(210) ->
	100;
get_val(220) ->
	99;
get_val(230) ->
	95;
get_val(240) ->
	92;
get_val(250) ->
	89;
get_val(260) ->
	86;
get_val(270) ->
	83;
get_val(280) ->
	80;
get_val(290) ->
	78;
get_val(300) ->
	76;
get_val(310) ->
	100;
get_val(320) ->
	100;
get_val(330) ->
	97;
get_val(340) ->
	94;
get_val(350) ->
	92;
get_val(360) ->
	90;
get_val(370) ->
	87;
get_val(380) ->
	85;
get_val(390) ->
	83;
get_val(400) ->
	80;
get_val(410) ->
	100;
get_val(420) ->
	100;
get_val(430) ->
	92;
get_val(440) ->
	80;
get_val(450) ->
	70;
get_val(460) ->
	63;
get_val(470) ->
	57;
get_val(480) ->
	52;
get_val(490) ->
	48;
get_val(500) ->
	44;
get_val(510) ->
	100;
get_val(520) ->
	100;
get_val(530) ->
	96;
get_val(540) ->
	91;
get_val(550) ->
	86;
get_val(560) ->
	82;
get_val(570) ->
	78;
get_val(580) ->
	74;
get_val(590) ->
	71;
get_val(600) ->
	68;
get_val(610) ->
	97;
get_val(620) ->
	94;
get_val(630) ->
	90;
get_val(640) ->
	87;
get_val(650) ->
	84;
get_val(660) ->
	81;
get_val(670) ->
	78;
get_val(680) ->
	76;
get_val(690) ->
	74;
get_val(700) ->
	71;
get_val(710) ->
	100;
get_val(720) ->
	100;
get_val(730) ->
	98;
get_val(740) ->
	95;
get_val(750) ->
	93;
get_val(760) ->
	91;
get_val(770) ->
	88;
get_val(780) ->
	86;
get_val(790) ->
	84;
get_val(800) ->
	82;
get_val(_) ->
	100.

