%%----------------------------------------------------
%% 仙宠真身数据
%% @author weihua@jieyou.cn
%%----------------------------------------------------
-module(pet_rb_data).
-export([get/1, list/0, card_rb_mapping/1]).

-include("pet_rb.hrl").

list() ->
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66].

card_rb_mapping(23500) -> 1;
card_rb_mapping(23501) -> 2;
card_rb_mapping(23502) -> 3;
card_rb_mapping(23503) -> 4;
card_rb_mapping(23520) -> 5;
card_rb_mapping(23521) -> 6;
card_rb_mapping(23522) -> 7;
card_rb_mapping(23523) -> 8;
card_rb_mapping(23524) -> 9;
card_rb_mapping(23525) -> 10;
card_rb_mapping(23526) -> 11;
card_rb_mapping(23527) -> 12;
card_rb_mapping(23528) -> 13;
card_rb_mapping(23529) -> 14;
card_rb_mapping(23530) -> 15;
card_rb_mapping(23531) -> 16;
card_rb_mapping(23532) -> 17;
card_rb_mapping(23564) -> 18;
card_rb_mapping(23561) -> 19;
card_rb_mapping(23563) -> 20;
card_rb_mapping(23562) -> 21;
card_rb_mapping(23565) -> 22;
card_rb_mapping(23560) -> 23;
card_rb_mapping(23583) -> 24;
card_rb_mapping(23584) -> 25;
card_rb_mapping(23586) -> 26;
card_rb_mapping(23587) -> 27;
card_rb_mapping(23533) -> 28;
card_rb_mapping(23585) -> 31;
card_rb_mapping(23536) -> 32;
card_rb_mapping(23504) -> 33;
card_rb_mapping(23505) -> 34;
card_rb_mapping(23506) -> 35;
card_rb_mapping(23534) -> 36;
card_rb_mapping(23535) -> 37;
card_rb_mapping(23538) -> 38;
card_rb_mapping(23537) -> 39;
card_rb_mapping(23539) -> 40;
card_rb_mapping(23566) -> 41;
card_rb_mapping(23567) -> 42;
card_rb_mapping(23568) -> 43;
card_rb_mapping(23540) -> 44;
card_rb_mapping(23541) -> 45;
card_rb_mapping(23542) -> 46;
card_rb_mapping(23543) -> 47;
card_rb_mapping(23544) -> 48;
card_rb_mapping(23545) -> 49;
card_rb_mapping(23546) -> 50;
card_rb_mapping(23547) -> 51;
card_rb_mapping(23548) -> 52;
card_rb_mapping(23549) -> 53;
card_rb_mapping(23550) -> 54;
card_rb_mapping(23551) -> 55;
card_rb_mapping(23552) -> 56;
card_rb_mapping(23581) -> 57;
card_rb_mapping(23582) -> 58;
card_rb_mapping(23580) -> 59;
card_rb_mapping(23507) -> 60;
card_rb_mapping(23553) -> 61;
card_rb_mapping(23556) -> 62;
card_rb_mapping(23557) -> 63;
card_rb_mapping(23554) -> 64;
card_rb_mapping(23555) -> 65;
card_rb_mapping(23558) -> 66;
card_rb_mapping(_CardId) -> false.

get(1) ->
    {ok, #pet_rb{
            id = 1
            ,name = <<"[完美]真·迷你龙">>
            ,type = 4
            ,value = 200
            ,card = 23500
            ,image = 124023
            ,desc = <<"传说中上古魔龙的蛋孵化而出,拥有远超寻常仙宠的能力。">>
            ,material = [{23400,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(2) ->
    {ok, #pet_rb{
            id = 2
            ,name = <<"[完美]真·月桂仙子">>
            ,type = 4
            ,value = 200
            ,card = 23501
            ,image = 124024
            ,desc = <<"月桂树下，一颗种子开始慢慢发芽，一道光闪过，月桂仙子诞生了">>
            ,material = [{23401,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(3) ->
    {ok, #pet_rb{
            id = 3
            ,name = <<"[完美]真·小狮妹">>
            ,type = 4
            ,value = 200
            ,card = 23502
            ,image = 124025
            ,desc = <<"小狮妹天生长相俊俏，声音甜美，被称为天下第一狮子美人。">>
            ,material = [{23402,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(4) ->
    {ok, #pet_rb{
            id = 4
            ,name = <<"[完美]真·小仙鹿">>
            ,type = 4
            ,value = 200
            ,card = 23503
            ,image = 124026
            ,desc = <<"小小的仙鹿，却有着翻天覆地的力量。">>
            ,material = [{23403,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(5) ->
    {ok, #pet_rb{
            id = 5
            ,name = <<"[优秀]玄冥虎刹">>
            ,type = 3
            ,value = 150
            ,card = 23520
            ,image = 124020
            ,desc = <<"虎刹喜欢的女子说过：“你穿铠甲的样子很可爱”，于是虎刹便永远拿着剑，身着重铠。">>
            ,material = [{23404,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(6) ->
    {ok, #pet_rb{
            id = 6
            ,name = <<"[优秀]伊邪那岐">>
            ,type = 3
            ,value = 150
            ,card = 23521
            ,image = 124021
            ,desc = <<"传说，伊邪那岐是父神,是日本神话中最重要的神灵之一，出现在日本神话的各个角落。">>
            ,material = [{23405,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(7) ->
    {ok, #pet_rb{
            id = 7
            ,name = <<"[优秀]慧心灵姬">>
            ,type = 3
            ,value = 150
            ,card = 23522
            ,image = 124022
            ,desc = <<"慧心灵姬乃一代灵姬，蕙质兰心，并同时拥有着摄人心魄的美丽">>
            ,material = [{23406,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(8) ->
    {ok, #pet_rb{
            id = 8
            ,name = <<"[优秀]小蘑菇">>
            ,type = 3
            ,value = 150
            ,card = 23523
            ,image = 124042
            ,desc = <<"小蘑菇本应生活在天庭月桂树上，因调皮而被逐出天庭。">>
            ,material = [{23421,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(9) ->
    {ok, #pet_rb{
            id = 9
            ,name = <<"[优秀]虫虫特工">>
            ,type = 3
            ,value = 150
            ,card = 23524
            ,image = 124043
            ,desc = <<"传说在一个美丽的蚂蚁王国，虫虫特工匠心独运发明创造，深受大家喜爱。">>
            ,material = [{23422,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(10) ->
    {ok, #pet_rb{
            id = 10
            ,name = <<"[优秀]小马哥">>
            ,type = 3
            ,value = 150
            ,card = 23525
            ,image = 124044
            ,desc = <<"传说中仙人下凡留下的随从,拥有远超寻常仙宠的能力。">>
            ,material = [{23423,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(11) ->
    {ok, #pet_rb{
            id = 11
            ,name = <<"[优秀]万圣节小南瓜">>
            ,type = 3
            ,value = 150
            ,card = 23526
            ,image = 124045
            ,desc = <<"调皮的小精灵，万圣节时贪玩附灵于小南瓜。可爱的小南瓜从此被赋予了灵魂。">>
            ,material = [{23424,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(12) ->
    {ok, #pet_rb{
            id = 12
            ,name = <<"[优秀]花楹精灵">>
            ,type = 3
            ,value = 150
            ,card = 23527
            ,image = 124046
            ,desc = <<"花楹精灵是天地间唯一能孕育五毒珠的妖兽，具有强大的化解之力，因其力量近于仙而不容于妖类。">>
            ,material = [{23425,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(13) ->
    {ok, #pet_rb{
            id = 13
            ,name = <<"[优秀]圣诞雪人">>
            ,type = 3
            ,value = 150
            ,card = 23528
            ,image = 124048
            ,desc = <<"传说中仙人下凡留下的随从,拥有远超寻常仙宠的能力。">>
            ,material = [{23425,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(14) ->
    {ok, #pet_rb{
            id = 14
            ,name = <<"[优秀]霜焰冥龙">>
            ,type = 3
            ,value = 150
            ,card = 23529
            ,image = 124049
            ,desc = <<"传说中仙人下凡留下的随从,拥有远超寻常仙宠的能力。">>
            ,material = [{23426,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(15) ->
    {ok, #pet_rb{
            id = 15
            ,name = <<"[优秀]皮皮可西">>
            ,type = 3
            ,value = 150
            ,card = 23530
            ,image = 124047
            ,desc = <<"有着一双水汪汪的大眼睛，令无数少男神魂颠倒。">>
            ,material = [{23427,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(16) ->
    {ok, #pet_rb{
            id = 16
            ,name = <<"[优秀]蓝兔精灵">>
            ,type = 3
            ,value = 150
            ,card = 23531
            ,image = 124040
            ,desc = <<"传说蓝兔为玉蟾宫宫主，冰魄剑剑主，她美丽、善良，被称为武林第一美人">>
            ,material = [{23428,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(17) ->
    {ok, #pet_rb{
            id = 17
            ,name = <<"[优秀]粉兔精灵">>
            ,type = 3
            ,value = 150
            ,card = 23532
            ,image = 124041
            ,desc = <<"传说粉兔是蓝兔妹妹，生活在玉蟾宫中深得蓝兔宠爱，生性调皮可爱。">>
            ,material = [{23429,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(18) ->
    {ok, #pet_rb{
            id = 18
            ,name = <<"[精良]冰灵兽">>
            ,type = 2
            ,value = 100
            ,card = 23564
            ,image = 124029
            ,desc = <<"冰灵兽没有形体，但它仰慕天马的外表，于是想办法将自己冻在了天马的体内。">>
            ,material = [{23409,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(19) ->
    {ok, #pet_rb{
            id = 19
            ,name = <<"[精良]巨灵天">>
            ,type = 2
            ,value = 100
            ,card = 23561
            ,image = 124031
            ,desc = <<"巨灵天乃是天将之一，担任守卫天宫天门的重任，力大无穷，可举动高山，劈开大石。">>
            ,material = [{23411,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(20) ->
    {ok, #pet_rb{
            id = 20
            ,name = <<"[精良]狂暴树妖">>
            ,type = 2
            ,value = 100
            ,card = 23563
            ,image = 124033
            ,desc = <<"千年老树，传言吸纳天地灵气，又传在阴秽处吸得怨灵妖力，因而成精。">>
            ,material = [{23413,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(21) ->
    {ok, #pet_rb{
            id = 21
            ,name = <<"[精良]小刑天">>
            ,type = 2
            ,value = 100
            ,card = 23562
            ,image = 124037
            ,desc = <<"刑天与天帝争神，帝断其首，葬之常羊之山。乃刑天以乳为目，以脐为口，操干戚以舞。">>
            ,material = [{23417,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(22) ->
    {ok, #pet_rb{
            id = 22
            ,name = <<"[精良]炎灵兽">>
            ,type = 2
            ,value = 100
            ,card = 23565
            ,image = 124038
            ,desc = <<"炎灵兽一直以炎之右手为荣。如果你用力抓他的头发，他会丢掉这个假肢告诉你以后再也不骗人了。">>
            ,material = [{23418,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(23) ->
    {ok, #pet_rb{
            id = 23
            ,name = <<"[精良]镇妖塔">>
            ,type = 2
            ,value = 100
            ,card = 23560
            ,image = 124039
            ,desc = <<"妖怪之老大，长年被困在镇妖塔，邪恶的外形下，其实隐藏着一颗善良的心。">>
            ,material = [{23419,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(24) ->
    {ok, #pet_rb{
            id = 24
            ,name = <<"[普通]花千骨">>
            ,type = 1
            ,value = 50
            ,card = 23583
            ,image = 124030
            ,desc = <<"天生丹凤眼，小蛮腰。一朝得道成了妖，来去自如江湖飘。">>
            ,material = [{23410,1},{23040,10}]
            ,attr = [{230, 1000},{232, 200},{234, 200},{253, 80},{254, 80},{255, 80},{256, 80},{257, 80}]
        }
    };
get(25) ->
    {ok, #pet_rb{
            id = 25
            ,name = <<"[普通]狂暴花妖">>
            ,type = 1
            ,value = 50
            ,card = 23584
            ,image = 124032
            ,desc = <<"春天，埋下一粒花种，秋天，收获了……啊啊啊，怎么变成花妖？">>
            ,material = [{23412,1},{23040,10}]
            ,attr = [{230, 1000},{232, 200},{234, 200},{253, 80},{254, 80},{255, 80},{256, 80},{257, 80}]
        }
    };
get(26) ->
    {ok, #pet_rb{
            id = 26
            ,name = <<"[普通]通天熊猫精英">>
            ,type = 1
            ,value = 50
            ,card = 23586
            ,image = 124036
            ,desc = <<"侠之大者，熊猫为尊。会耍几套小功夫，手持竹剑，仗剑江湖；路见不平，拔刀添乱。">>
            ,material = [{23416,1},{23040,10}]
            ,attr = [{230, 1000},{232, 200},{234, 200},{253, 80},{254, 80},{255, 80},{256, 80},{257, 80}]
        }
    };
get(27) ->
    {ok, #pet_rb{
            id = 27
            ,name = <<"[优秀]玉锦祥蛇">>
            ,type = 3
            ,value = 150
            ,card = 23587
            ,image = 124051
            ,desc = <<"玉锦祥蛇，吉祥尊贵的圣灵，也是平安喜福的守护神！">>
            ,material = [{23430,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(28) ->
    {ok, #pet_rb{
            id = 28
            ,name = <<"[优秀]瑞兽">>
            ,type = 3
            ,value = 150
            ,card = 23533
            ,image = 124050
            ,desc = <<"瑞兽，吉祥的神兽，代表着人类平安幸福的吉祥物！">>
            ,material = [{23431,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(31) ->
    {ok, #pet_rb{
            id = 31
            ,name = <<"[优秀]琴虫">>
            ,type = 3
            ,value = 150
            ,card = 23585
            ,image = 124028
            ,desc = <<"传说中的怪蛇，兽首蛇身，它时常问自己“我是谁”">>
            ,material = [{23408,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(32) ->
    {ok, #pet_rb{
            id = 32
            ,name = <<"[优秀]汤圆宝宝">>
            ,type = 3
            ,value = 150
            ,card = 23536
            ,image = 124052
            ,desc = <<"调皮的汤圆宝宝，在元宵节偷偷逃出来，它似乎对这个世界充满着好奇与喜爱!">>
            ,material = [{23434,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(33) ->
    {ok, #pet_rb{
            id = 33
            ,name = <<"[完美]真·雏凤凰">>
            ,type = 4
            ,value = 200
            ,card = 23504
            ,image = 124055
            ,desc = <<"雏形的凤凰，体型虽小，但是拥有不可思议的力量。">>
            ,material = [{23435,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(34) ->
    {ok, #pet_rb{
            id = 34
            ,name = <<"[完美]真·如意">>
            ,type = 4
            ,value = 200
            ,card = 23505
            ,image = 124056
            ,desc = <<"如意之灵幻化成小仙童，精灵可爱，羡煞旁人。">>
            ,material = [{23436,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(35) ->
    {ok, #pet_rb{
            id = 35
            ,name = <<"[完美]真·牡丹仙子">>
            ,type = 4
            ,value = 200
            ,card = 23506
            ,image = 124057
            ,desc = <<"千年牡丹之灵所化，美艳如牡丹。">>
            ,material = [{23437,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(36) ->
    {ok, #pet_rb{
            id = 36
            ,name = <<"[优秀]粽宝宝">>
            ,type = 3
            ,value = 150
            ,card = 23534
            ,image = 124054
            ,desc = <<"粽宝宝，肥嘟嘟的小身材，叫人爱恨交加啊！">>
            ,material = [{23432,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(37) ->
    {ok, #pet_rb{
            id = 37
            ,name = <<"[优秀]奥运吉祥物">>
            ,type = 3
            ,value = 150
            ,card = 23535
            ,image = 124053
            ,desc = <<"奥运宝宝，爱运动、爱耍帅、更爱健康，护佑着世界一片和平安宁！">>
            ,material = [{23433,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(38) ->
    {ok, #pet_rb{
            id = 38
            ,name = <<"[优秀]喵星人">>
            ,type = 3
            ,value = 150
            ,card = 23538
            ,image = 124058
            ,desc = <<"喵星人，由猫幻化而成，喜欢卖萌，逗人喜欢。">>
            ,material = [{23439,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(39) ->
    {ok, #pet_rb{
            id = 39
            ,name = <<"[优秀]飞仙吉祥物">>
            ,type = 3
            ,value = 150
            ,card = 23537
            ,image = 124059
            ,desc = <<"飞仙官方首个公布的吉祥物，它集合着天地的力量，守护着飞仙的祥和！">>
            ,material = [{23438,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(40) ->
    {ok, #pet_rb{
            id = 40
            ,name = <<"[优秀]灵龙">>
            ,type = 3
            ,value = 150
            ,card = 23539
            ,image = 124061
            ,desc = <<"充满灵气的龙宝宝，身手矫健，行动敏捷，还会喷火哦！">>
            ,material = [{23440,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(41) ->
    {ok, #pet_rb{
            id = 41
            ,name = <<"[精良]画魅">>
            ,type = 2
            ,value = 100
            ,card = 23566
            ,image = 124062
            ,desc = <<"仙洞中放着一本写满神秘字符的古书，书中的文字吸得天地灵气，幻化成魅魔，游荡人世之间！">>
            ,material = [{23441,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(42) ->
    {ok, #pet_rb{
            id = 42
            ,name = <<"[精良]笔魅">>
            ,type = 2
            ,value = 100
            ,card = 23567
            ,image = 124063
            ,desc = <<"一支放于古书旁的毛笔，经历了日日夜夜的仙气吸收，幻化成仙，来到人间！">>
            ,material = [{23442,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(43) ->
    {ok, #pet_rb{
            id = 43
            ,name = <<"[精良]书魅">>
            ,type = 2
            ,value = 100
            ,card = 23568
            ,image = 124064
            ,desc = <<"书中自有黄金屋，书中自有书成魅！">>
            ,material = [{23443,1},{23040,20}]
            ,attr = [{230, 1200},{232, 300},{234, 300},{253, 100},{254, 100},{255, 100},{256, 100},{257, 100}]
        }
    };
get(44) ->
    {ok, #pet_rb{
            id = 44
            ,name = <<"[优秀]白羊座">>
            ,type = 3
            ,value = 150
            ,card = 23540
            ,image = 124065
            ,desc = <<"白羊座，斗志昂扬、动如疾风">>
            ,material = [{23444,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(45) ->
    {ok, #pet_rb{
            id = 45
            ,name = <<"[优秀]金牛座">>
            ,type = 3
            ,value = 150
            ,card = 23541
            ,image = 124066
            ,desc = <<"金牛座，偶尔狂野、偶尔安静。">>
            ,material = [{23445,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(46) ->
    {ok, #pet_rb{
            id = 46
            ,name = <<"[优秀]双子座">>
            ,type = 3
            ,value = 150
            ,card = 23542
            ,image = 124067
            ,desc = <<"双子座，精力充沛、勇于冒险。">>
            ,material = [{23446,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(47) ->
    {ok, #pet_rb{
            id = 47
            ,name = <<"[优秀]巨蟹座">>
            ,type = 3
            ,value = 150
            ,card = 23543
            ,image = 124068
            ,desc = <<"巨蟹座，敏锐感知、暴躁之力。">>
            ,material = [{23447,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(48) ->
    {ok, #pet_rb{
            id = 48
            ,name = <<"[优秀]狮子座">>
            ,type = 3
            ,value = 150
            ,card = 23544
            ,image = 124069
            ,desc = <<"狮子座，慷慨激情、感化世人。">>
            ,material = [{23448,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(49) ->
    {ok, #pet_rb{
            id = 49
            ,name = <<"[优秀]处女座">>
            ,type = 3
            ,value = 150
            ,card = 23545
            ,image = 124070
            ,desc = <<"处女座, 洞察万物，净化心灵。">>
            ,material = [{23449,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(50) ->
    {ok, #pet_rb{
            id = 50
            ,name = <<"[优秀]天秤座">>
            ,type = 3
            ,value = 150
            ,card = 23546
            ,image = 124071
            ,desc = <<"天秤座，巧捷万端，万象平衡。">>
            ,material = [{23450,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(51) ->
    {ok, #pet_rb{
            id = 51
            ,name = <<"[优秀]天蝎座">>
            ,type = 3
            ,value = 150
            ,card = 23547
            ,image = 124072
            ,desc = <<"天蝎座，惊世强韧，不败灵感。">>
            ,material = [{23451,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(52) ->
    {ok, #pet_rb{
            id = 52
            ,name = <<"[优秀]射手座">>
            ,type = 3
            ,value = 150
            ,card = 23548
            ,image = 124073
            ,desc = <<"射手座，灵心敏砂，逐日逐月。">>
            ,material = [{23452,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(53) ->
    {ok, #pet_rb{
            id = 53
            ,name = <<"[优秀]摩羯座">>
            ,type = 3
            ,value = 150
            ,card = 23549
            ,image = 124074
            ,desc = <<"摩羯座，坚毅不屈，无量集思。">>
            ,material = [{23453,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(54) ->
    {ok, #pet_rb{
            id = 54
            ,name = <<"[优秀]水瓶座">>
            ,type = 3
            ,value = 150
            ,card = 23550
            ,image = 124075
            ,desc = <<"水瓶座，极富理性，忠于信念。">>
            ,material = [{23454,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(55) ->
    {ok, #pet_rb{
            id = 55
            ,name = <<"[优秀]双鱼座">>
            ,type = 3
            ,value = 150
            ,card = 23551
            ,image = 124076
            ,desc = <<"双鱼座，大义凛然，赤子之心。">>
            ,material = [{23455,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(56) ->
    {ok, #pet_rb{
            id = 56
            ,name = <<"[优秀]莲花仙宠">>
            ,type = 3
            ,value = 150
            ,card = 23552
            ,image = 124079
            ,desc = <<"莲花，清纯脱俗，出淤泥而不染，君子之爱！">>
            ,material = [{23457,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(57) ->
    {ok, #pet_rb{
            id = 57
            ,name = <<"[优秀]烈焰战魂">>
            ,type = 3
            ,value = 150
            ,card = 23581
            ,image = 124034
            ,desc = <<"烈焰战魂，宠物中的战斗机，偶也！">>
            ,material = [{23414,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(58) ->
    {ok, #pet_rb{
            id = 58
            ,name = <<"[普通]青猿妖圣">>
            ,type = 1
            ,value = 50
            ,card = 23582
            ,image = 124035
            ,desc = <<"青猿经过一番努力修炼，终成妖圣。">>
            ,material = [{23407,1},{23040,10}]
            ,attr = [{230, 1000},{232, 200},{234, 200},{253, 80},{254, 80},{255, 80},{256, 80},{257, 80}]
        }
    };
get(59) ->
    {ok, #pet_rb{
            id = 59
            ,name = <<"[优秀]（地狱）烈焰战魂">>
            ,type = 3
            ,value = 150
            ,card = 23580
            ,image = 124027
            ,desc = <<"（地狱）烈焰战魂，战斗机中的的战斗机，偶也！">>
            ,material = [{23415,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(60) ->
    {ok, #pet_rb{
            id = 60
            ,name = <<"[完美]雅典娜">>
            ,type = 4
            ,value = 200
            ,card = 23507
            ,image = 124077
            ,desc = <<"雅典娜，智慧的女神，和平劳动和科学的庇护者！">>
            ,material = [{23456,1},{23040,30}]
            ,attr = [{230, 2000},{232, 500},{234, 600},{253, 200},{254, 200},{255, 200},{256, 200},{257, 200}]
        }
    };
get(61) ->
    {ok, #pet_rb{
            id = 61
            ,name = <<"[优秀]哆啦A梦">>
            ,type = 3
            ,value = 150
            ,card = 23553
            ,image = 124080
            ,desc = <<"可爱的哆啦A梦，一不小心启动时光穿梭机，来到飞仙世界……">>
            ,material = [{23458,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(62) ->
    {ok, #pet_rb{
            id = 62
            ,name = <<"[优秀]小火轮">>
            ,type = 3
            ,value = 150
            ,card = 23556
            ,image = 124083
            ,desc = <<"小火轮，有着一个无敌风火轮，它独一无二">>
            ,material = [{23461,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(63) ->
    {ok, #pet_rb{
            id = 63
            ,name = <<"[优秀]乔巴">>
            ,type = 3
            ,value = 150
            ,card = 23557
            ,image = 124084
            ,desc = <<"二货乔巴，被人夸奖的时候，总是相当想掩饰自己的情绪却不太会掩饰">>
            ,material = [{23462,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(64) ->
    {ok, #pet_rb{
            id = 64
            ,name = <<"[优秀]神荼门神">>
            ,type = 3
            ,value = 150
            ,card = 23554
            ,image = 124081
            ,desc = <<"身着斑斓战甲，手执金色战戢，神荼是制伏恶鬼的神人">>
            ,material = [{23459,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(65) ->
    {ok, #pet_rb{
            id = 65
            ,name = <<"[优秀]郁垒门神">>
            ,type = 3
            ,value = 150
            ,card = 23555
            ,image = 124082
            ,desc = <<"欹斜头上帽，他就是郁垒，与神荼共同制伏恶鬼">>
            ,material = [{23460,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(66) ->
    {ok, #pet_rb{
            id = 66
            ,name = <<"[优秀]梦蝶仙子">>
            ,type = 3
            ,value = 150
            ,card = 23558
            ,image = 124085
            ,desc = <<"庄生晓梦迷蝴蝶，梦蝶仙子现人间">>
            ,material = [{23463,1},{23040,25}]
            ,attr = [{230, 1500},{232, 400},{234, 400},{253, 150},{254, 150},{255, 150},{256, 150},{257, 150}]
        }
    };
get(_Id) -> false.
