%%----------------------------------------------------
%% 坐骑活动奖励
%% @author whjing2011@gmail.com
%%----------------------------------------------------
-module(mount_reward).
-export([listener/3]).
-include("common.hrl").

listener(_Mod, _Role, _Arg) -> ok.

%%--------------------
%% 内部方法
%%--------------------

%% 进阶开服类
%% do(upgrade_open, Role, 3) ->
%%     Subject = ?L(<<"开服活动奖励">>),
%%     Content = ?L(<<"恭喜您在新服坐骑进阶活动中成功将坐骑进阶至3阶，特此发放您的奖励，请注意查收，祝您在飞仙的旅途上开心顺利！">>),
%%     Items = [{33051, 1, 2}, {21021, 1, 2}, {32301, 1, 10}, {32303, 1, 5}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% do(upgrade_open, Role, 4) ->
%%     Subject = ?L(<<"开服活动奖励">>),
%%     Content = ?L(<<"恭喜您在新服坐骑进阶活动中成功将坐骑进阶至4阶，特此发放您的奖励，请注意查收，祝您在飞仙的旅途上开心顺利！">>),
%%     Items = [{33051, 1, 5}, {21022, 1, 2}, {32301, 1, 100}, {32303, 1, 10}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% 
%% %% 进阶活动类
%% do(upgrade_camp, Role, 3) ->
%%     Subject = ?L(<<"国庆同乐之坐骑进阶">>),
%%     Content = <<"亲爱的玩家，感谢您对梦幻飞仙的鼎力支持。国庆活动期间，您的坐骑阶数达到3阶，获得了下列额外超值大礼哦！
%% 请注意查收，祝您游戏愉快！">>,
%%     Items = [{33051, 1, 2}, {32301, 1, 10}, {32303, 1, 5}, {21021, 1, 2}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% do(upgrade_camp, Role, 4) ->
%%     Subject = ?L(<<"国庆同乐之坐骑进阶">>),
%%     Content = <<"亲爱的玩家，感谢您对梦幻飞仙的鼎力支持。国庆活动期间，您的坐骑阶数达到4阶，获得了下列额外超值大礼哦！
%% 请注意查收，祝您游戏愉快！">>,
%%     Items = [{33051, 1, 5}, {32301, 1, 100}, {32303, 1, 10}, {21022, 1, 2}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% do(upgrade_camp, Role, 5) ->
%%     Subject = ?L(<<"国庆同乐之坐骑进阶">>),
%%     Content = <<"亲爱的玩家，感谢您对梦幻飞仙的鼎力支持。国庆活动期间，您的坐骑阶数达到5阶，获得了下列额外超值大礼哦！
%% 请注意查收，祝您游戏愉快！">>,
%%     Items = [{33051, 1, 8}, {32301, 1, 150}, {32303, 1, 15}, {21022, 1, 4}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% do(upgrade_camp, Role, 6) ->
%%     Subject = ?L(<<"国庆同乐之坐骑进阶">>),
%%     Content = <<"亲爱的玩家，感谢您对梦幻飞仙的鼎力支持。国庆活动期间，您的坐骑阶数达到6阶，获得了下列额外超值大礼哦！
%% 请注意查收，祝您游戏愉快！">>,
%%     Items = [{33051, 1, 10}, {32301, 1, 200}, {32303, 1, 20}, {21022, 1, 8}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% do(upgrade_camp, Role, 7) ->
%%     Subject = ?L(<<"国庆同乐之坐骑进阶">>),
%%     Content = <<"亲爱的玩家，感谢您对梦幻飞仙的鼎力支持。国庆活动期间，您的坐骑阶数达到7阶，获得了下列额外超值大礼哦！
%% 请注意查收，祝您游戏愉快！">>,
%%     Items = [{33051, 1, 15}, {32301, 1, 250}, {32303, 1, 30}, {21022, 1, 8}],
%%     mail_mgr:deliver(Role, {Subject, Content, [], Items});
%% do(_Mod, _Role, _Arg) -> ok.
