%% ******************************
%% 日志记录相关配置
%% @author wpf (wprehard@qq.com)
%% ******************************

-module(log_cfg).
-export([
        conv_gold/2
    ]).

-include("mail.hrl").

%% @spec conv_gold(Cmd, Args) -> {HandleStr, RemarkStr} | {HandleStr, RemarkStr, StatKey} | ignore
%% Cmd = integer() 玩家操作协议号
%% Args = any() 玩家操作数据
%% HandleStr = RemarkStr = bitstring() 晶钻日志记录内容
%% @doc 配置晶钻记录内容，默认没有匹配的项，记录协议号
%% <div>
%%   1、在rpc处理完，且有新的Role数据产生才检测，并自动记录；
%%　 2、类似交易、充值等产生的晶钻消耗，同步或者异步处理的，要单独记录；
%%   3、分类下，有需要额外添加统计关键字的需要返回，否则默认按照类型名
%% </div>
%% --------------------------------------------------------
conv_gold(10019, _) -> {<<"复活">>, <<"">>};
% conv_gold(10021, _) -> {<<"传送">>, <<"">>};
% conv_gold(10025, _) -> {<<"转换阵营">>, <<"">>};

% conv_gold(10217, {TaskId}) -> {<<"任务">>, util:fbin(<<"快速完成，任务ID:~w">>, [TaskId]), <<"快速完成任务">>};
% conv_gold(10221, _) -> {<<"任务">>, <<"修行任务刷新">>, <<"修行任务刷新">>};

conv_gold(10333, {Storage}) ->
    {<<"包裹扩展">>, util:fbin(<<"~s扩展">>, [log_conv:item(storage, Storage)])};
conv_gold(10315, _) -> ignore;
conv_gold(10361, _) ->
    {<<"购买金币">>, <<"购买金币">>};



conv_gold(10505, _) ->
    {<<"锻造">>, <<"强化">>};
conv_gold(10510, _) ->
    {<<"锻造">>, <<"洗炼一次">>};
conv_gold(10511, _) ->
    {<<"锻造">>, <<"宝石合成">>};
conv_gold(10516, _) ->
    {<<"锻造">>, <<"精炼">>};
conv_gold(10522, _) ->
    {<<"锻造">>, <<"批量洗炼">>};
conv_gold(10544, _) ->
    {<<"锻造">>, <<"装备升级">>};
conv_gold(10545, _) ->
    {<<"锻造">>, <<"升级宝石">>};


% conv_gold(10910, _) ->
%     {<<"聊天">>, <<"跨服聊天">>};

conv_gold(11706, {Id}) -> 
    Subject = case get(role_info) of
        {Rid, SrvId, _Account} ->
            case catch mail_dao:select(Rid, SrvId, Id) of
                {ok, #mail{subject = Sub}} -> Sub;
                _ -> <<"">>
            end;
        _ -> <<"">>
    end,
    {<<"邮件领取">>, <<"邮件领取">>, Subject};
conv_gold(11706, _) -> {<<"邮件领取">>, <<"">>};

% conv_gold(11304, _) -> {<<"市场消费">>, <<"拍卖晶钻">>, <<"拍卖晶钻">>};
% conv_gold(11306, _) -> {<<"市场消费">>, <<"购买拍卖物品">>, <<"市场购买">>};
% conv_gold(11332, _) -> {<<"市场消费">>, <<"发布求购物品">>, <<"市场求购">>};
% conv_gold(11333, _) -> {<<"市场消费">>, <<"取消求购">>, <<"取消求购">>};
% conv_gold(11334, _) -> {<<"市场消费">>, <<"直接出售给求购">>, <<"出售求购">>};

conv_gold(11344, _) -> {<<"交易所消费">>, <<"购买物品">>, <<"购买物品">>};

% conv_gold(11506, _) -> {<<"购买熟练度">>, <<>>};
% conv_gold(11560, _) -> {<<"职业进阶">>, <<>>};

conv_gold(11907, _) -> {<<"神秘商店消费">>, <<"刷新神秘商店">>, <<"刷新神秘商店">>};
conv_gold(11908, _) -> {<<"神秘商店消费">>, <<"购买神秘商店物品">>, <<"购买神秘商店物品">>};

% conv_gold(11931, _) -> {<<"神秘商店消费">>, <<"购买副本神秘商人物品">>, <<"购买副本神秘商人物品">>};
%% 梦幻宝盒
% conv_gold(11941, _) -> {<<"梦幻宝盒刷新">>, <<>>};
% conv_gold(11942, _) -> {<<"梦幻宝盒购买">>, <<>>};

conv_gold(12010, _) -> ignore; %% {<<"商城购买">>, <<"">>};
% conv_gold(12020, _) -> ignore; %% {<<"商城抢购1">>, <<"">>};
% conv_gold(12025, _) -> ignore; %% {<<"商城抢购2">>, <<"">>};
% conv_gold(12027, _) -> ignore; %% {<<"商城抢购3">>, <<"">>};
% conv_gold(12029, _) -> ignore; %% 购买宠物限购商品
% conv_gold(12032, _) -> ignore; %% 购买活动商品
% conv_gold(12033, _) -> ignore; %% 购买活动专区限购商品
% conv_gold(12034, _) -> ignore; %% 购买活动专区有数量限购商品
% conv_gold(12026, {30010, _}) -> {<<"直接购买金币">>, <<"">>};
% conv_gold(12026, {32512, _}) -> {<<"直接购买高级经验符">>, <<"">>};
% conv_gold(12035, _) -> {<<"购买抢购商品">>, <<"">>};

% conv_gold(12404, {Type}) -> {<<"VIP购买">>, util:fbin(<<"类型:~w">>, [Type])};

conv_gold(12412, {Lev}) -> {<<"VIP购买">>, util:fbin(<<"购买礼包等级:~w">>, [Lev])};

% conv_gold(12605, _) -> {<<"宠物消费">>, <<"扩展宠物栏">>, <<"扩展宠物栏">>};
conv_gold(12608, _) -> {<<"伙伴消费">>, <<"购买更名次数">>, <<"购买更名次数">>};
% conv_gold(12641, _) -> {<<"宠物消费">>, <<"宠物更换外观冷却时间">>, <<"宠物更换外观冷却时间">>};
% conv_gold(12643, _) -> {<<"宠物消费">>, <<"开启双天赋">>, <<"开启双天赋">>};
% conv_gold(12645, _) -> {<<"宠物消费">>, <<"切换天赋">>, <<"切换天赋">>};

conv_gold(12615, _) -> {<<"伙伴消费">>, <<"潜能提升">>, <<"潜能提升">>};
conv_gold(12616, _) -> {<<"伙伴消费">>, <<"单项洗髓">>, <<"单项洗髓">>};
conv_gold(12621, _) -> {<<"伙伴消费">>, <<"批量洗髓">>, <<"批量洗髓">>};

conv_gold(12693, _) -> {<<"伙伴消费">>, <<"探寻一次龙族遗迹">>, <<"探寻一次龙族遗迹">>};
conv_gold(12694, _) -> {<<"伙伴消费">>, <<"批量探寻龙族遗迹">>, <<"批量探寻龙族遗迹">>};
conv_gold(12695, _) -> {<<"伙伴消费">>, <<"购买龙族物品">>, <<"购买龙族物品">>};


% conv_gold(12614, _) -> {<<"刷宠物蛋">>, <<>>};

% conv_gold(12661, _) -> {<<"猎魔">>, <<"召唤猎魔NPC">>, <<"召唤猎魔NPC">>};
% conv_gold(12662, {NpcId}) -> {<<"猎魔">>, util:fbin(<<"进行猎魔[Npc:~p]">>, [NpcId]), <<"猎魔">>};
% conv_gold(12665, {Num}) -> {<<"猎魔">>, util:fbin(<<"魔晶背包开格子[数量:~p]">>, [Num]), <<"魔晶背包扩展">>};
% conv_gold(12670, _) -> {<<"魔晶洗炼">>, <<"魔晶单洗">>, <<"魔晶洗练锁">>};
% conv_gold(12671, _) -> {<<"魔晶洗炼">>, <<"魔晶批洗">>, <<"魔晶洗练锁">>};


conv_gold(12703, _) -> {<<"军团">>, <<"创建军团">>};
conv_gold(12712, _) -> {<<"军团">>, <<"军团捐献">>};
% conv_gold(12770, {M}) -> {<<"宠物消费">>, util:fbin(<<"宠物寄养加速:~w分钟">>, [M]), <<"宠物寄养加速">>};

conv_gold(12863, _) -> {<<"世界Boss">>, <<"晶钻复活">>, <<"晶钻复活">>};

conv_gold(12903, _) -> {<<"元神消费">>, <<"元神加速">>, <<"元神加速">>};
conv_gold(12912, _) -> {<<"元神消费">>, <<"一键修炼">>, <<"一键修炼">>};

conv_gold(13064, _) -> {<<"勋章">>, <<"领取条件">>, <<"领取条件">>};

% conv_gold(13101, _) -> {<<"护送">>, <<"刷美女">>, <<"刷美女">>};
% conv_gold(13109, _) -> {<<"护送">>, <<"刷小屁孩">>, <<"刷小屁孩">>};

% conv_gold(13201, _) -> {<<"购买挂机">>, <<>>};

conv_gold(13503, _) -> {<<"副本消费">>, <<"购买副本次数">>, <<"购买副本次数">>};

conv_gold(13572, _) -> {<<"副本消费">>, <<"多人副本购买次数">>, <<"多人副本购买次数">>};

conv_gold(13585, _) -> {<<"副本消费">>, <<"扫荡副本">>, <<"扫荡副本">>};

conv_gold(13611, _) -> {<<"世界树">>, <<"失败购回">>, <<"失败购回">>};

conv_gold(13810, _) -> {<<"收取神秘来信">>, <<"">>};

conv_gold(13904, _) -> {<<"领取离线经验">>, <<"">>};

conv_gold(14002, _) -> {<<"礼包/活动奖励">>, <<"">>};
conv_gold(14013, _) -> {<<"购买飞仙基金">>, <<"">>};
conv_gold(14015, _) -> {<<"领取投资计划回报">>, <<"">>};

% conv_gold(14205, {1, _}) -> {<<"寻宝">>, <<"">>, <<"龙宫寻宝">>};
% conv_gold(14205, {2, _}) -> {<<"寻宝">>, <<"">>, <<"仙府寻宝">>};
% conv_gold(14205, {3, _}) -> {<<"寻宝">>, <<"">>, <<"天官赐福">>};
% conv_gold(14205, _) -> {<<"寻宝">>, <<"">>};

conv_gold(14229, _) -> {<<"淘宝">>, <<"一键开矿">>, <<"一键开矿">>};
conv_gold(14230, _) -> {<<"淘宝">>, <<"开矿一次">>, <<"开矿一次">>};

conv_gold(14430, _) -> {<<"酒桶节">>, <<"新手引导送10晶钻">>};
conv_gold(14437, _) -> {<<"酒桶节">>, <<"丢烟花">>};

% conv_gold(14708, _) -> {<<"摇钱树">>, <<"摇钱一次">>};
% conv_gold(14709, _) -> {<<"摇钱树">>, <<"一键摇钱">>};
% conv_gold(14724, _) -> ignore; %% {<<"幻灵采摘">>, <<>>};
% conv_gold(14734, _) -> {<<"嘉年华藏宝图">>, <<"翻开藏宝图残片">>};

% conv_gold(15001, _) -> {<<"通缉">>, <<>>};

% conv_gold(15105, _) -> {<<"刷新帮会试炼任务">>, <<>>};

% conv_gold(17608, _) -> {<<"副职业清除冷却时间">>, <<>>};

% conv_gold(15501, _) -> {<<"结婚消费">>, <<"请求结婚">>};
% conv_gold(15510, _) -> {<<"结婚消费">>, <<"撒糖果红包">>};
% conv_gold(15511, _) -> {<<"结婚消费">>, <<"送礼">>};
% conv_gold(15550, _) -> {<<"结婚消费">>, <<"婚礼送花">>};
% conv_gold(15534, _) -> {<<"结婚消费">>, <<"购买请帖">>};
% conv_gold(15515, {3}) -> {<<"结婚消费">>, <<"离婚">>};

% conv_gold(15702, _) -> {<<"仙园">>, <<"仙园开辟">>, <<"仙园开辟">>};
% conv_gold(15704, _) -> {<<"仙园">>, <<"仙蚌加速">>, <<"仙蚌加速">>};

% conv_gold(15852, _) -> {<<"活动兑换">>, <<>>, <<"活动兑换">>};

conv_gold(16104, _) -> {<<"中庭战神">>, <<"购买挑战次数">>, <<"中庭战神购买挑战次数">>};
conv_gold(16105, _) -> {<<"中庭战神">>, <<"加速CD">>, <<"中庭战神加速CD">>};

% conv_gold(16301, _) -> {<<"结拜消费">>, <<"结拜">>, <<"结拜">>};
% conv_gold(16303, _) -> {<<"结拜消费">>, <<"设置称号">>, <<"设置结拜称号">>};
% conv_gold(16307, _) -> {<<"结拜消费">>, <<"割袍断义">>, <<"割袍断义">>};

% conv_gold(16409, _) -> {<<"师徒消费">>, <<"弟子叛逃">>};

%% 翅膀进阶
conv_gold(16708, {_PriceType, BatchType}) -> {<<"刷新翅膀技能">>, util:fbin(<<"刷新技能，刷新类型:~p">>, [BatchType])};

%% 副本挂机
% conv_gold(13565, _) -> {<<"副本挂机加速">>, <<>>};

%% 守护
% conv_gold(17225, _) -> {<<"刷新守护神通">>, <<>>, <<"刷新守护神通">>};
% conv_gold(17212, _) -> {<<"守护洗髓">>, <<"洗练锁">>};
% conv_gold(17220, _) -> {<<"守护洗髓">>, <<"批洗，洗练锁">>};

%% 购买掠夺次数
conv_gold(17252, _) -> {<<"购买掠夺次数">>, <<"购买掠夺次数">>};

%% 缘分互动
% conv_gold(17714, {_Rid, _Srvid, Type}) -> {<<"缘分互动">>, util:fbin(<<"互动类型:~p">>, [Type])};


%% 跨服仙府
% conv_gold(17816, _) -> {<<"仙府驯养神兽">>, <<>>};

%% 召唤妖灵
% conv_gold(17901, {1, _}) -> {<<"召唤妖灵">>, <<>>};
% %% 神魔阵升级加速
% conv_gold(17909, _) -> {<<"神魔阵升级加速">>, <<>>};
% conv_gold(17918, _) -> {<<"一键提升灵宠阵">>, <<>>};
% conv_gold(17921, _) -> {<<"激活妖灵工坊">>, <<>>};
% conv_gold(17922, _) -> {<<"妖灵工坊开始生产">>, <<>>};
% conv_gold(17924, _) -> {<<"妖灵工坊加生产线">>, <<>>};
% conv_gold(17927, _) -> {<<"妖灵工坊加速">>, <<>>};

%% 军令状
% conv_gold(18203, {Id}) -> {<<"领取军令状任务">>, util:fbin(<<"领取任务:~p">>, [Id])};

%% 神药阁贡献
% conv_gold(18501, {2, _}) -> {<<"神药阁贡献">>, <<>>};
%% 仙宠阁贡献
% conv_gold(18601, {2, _}) -> {<<"仙宠阁贡献">>, <<>>};

%% 命格观星
% conv_gold(19001, {2}) -> {<<"命格观星">>, <<>>};
%% 命格空间扩展
% conv_gold(19003, _) -> {<<"命格空间扩展">>, <<>>};

%% 美女扫荡加速
% conv_gold(19107, _) -> {<<"加速扫荡美女">>, <<>>};

%% 庄园系统
conv_gold(19503, _) -> {<<"庄园">>, <<"消除打造宝石CD">>};
conv_gold(19507, _) -> {<<"庄园">>, <<"消除打造材料CD">>};
conv_gold(19516, _) -> {<<"庄园">>, <<"消除跑商CD">>};
conv_gold(19520, _) -> {<<"庄园">>, <<"消除训龙CD">>};



%% 飞仙历练
% conv_gold(18905, _) -> {<<"飞仙历练">>, <<>>};

% conv_gold(19301, _) -> {<<"捐献晶钻">>, <<>>};

%% 晶钻转盘
% conv_gold(14741, _) -> {<<"晶钻转盘">>, <<"获得晶钻">>};
% conv_gold(14739, _) -> {<<"晶钻转盘">>, <<"上次异常:发放晶钻">>};

%% 升级VIP帮会
% conv_gold(12791, _) -> {<<"升级为VIP帮会">>, <<>>};

%% 至尊消费特权
% conv_gold(15873, _) -> {<<"至尊消费特权">>, <<"至尊消费特权">>, <<"至尊消费特权">>};

%% 捕宠达人购买箭网
% conv_gold(19605, _) -> {<<"捕宠达人">>, <<"捕宠达人购买箭网">>};

%% 容错
conv_gold(Cmd, _) ->
    {util:fbin("CMD:~w", [Cmd]), <<"">>}.
