%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_festival_red_gift_priority
	%%% @Created : 2018-05-14 21:32:38
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_festival_red_gift_priority).
-export([get/1]).
-include("activity.hrl").
get(6603132) ->1;
get(6609043) ->2;
get(6609042) ->3;
get(6605041) ->4;
get(10199) ->5;
get(10106) ->6;
get(1045006) ->7;
get(8001305) ->8;
get(8001304) ->9;
get(1045007) ->10;
get(8001002) ->11;
get(5101402) ->12;
get(5101412) ->13;
get(5101422) ->14;
get(5101401) ->15;
get(5101411) ->16;
get(5101421) ->17;
get(2011000) ->18;
get(2012000) ->19;
get(2013000) ->20;
get(8001085) ->21;
get(_Id) -> 0.

