%% 配置生成时间 2018-04-23 20:11:23
-module(data_free_gift).
-export([get/1]).
-export([get_all/0]).
-include("activity.hrl").
get(1) -> #base_act_free_gift{open_info=#open_info{gp_id = [],gs_id=[30999,30098,30097,30031,30029,30028,30027,30024,30022,30020,30018,30017,30016,30015,30013,30012,30009,30007,30006,30005,30004,30003,30002,8003,8001,1001,1505,2002,2001,2650,2649,2648,2647,2646,2645,2644,2643,2642,2641,2640,2639,2638,2637,2636,2635,2634,2633,2631,2628,2626,2625,2619,2614,2613,2605,2603,2596,2593,2589,2585,2583,2578,2575,2570,2566,2544,2542,2540,2536,2533,2519,2501,3012,3011,3010,3009,3008,3007,3006,3551,3550,3549,3548,3547,3546,3545,3542,3539,3538,3534,3526,3521,3513,3501,5025,5023,5021,5019,6012,6010,6008,6006,4006,8542,8541,8540,8539,8538,8537,8536,8535,8534,8533,8531,8530,8529,8527,8523,8522,8521,8507,8505,8501,9004,9003,9002,9001,9505,9504,9503,9502,9501],open_day=1,end_day=2,start_time=0,end_time=0,limit_open_day=0,limit_end_day=0,merge_st_day=0,merge_et_day=0,merge_times_list=[],ignore_gs=[],priority=0,after_open_day=0},act_id=1,
        gift_list = [
   #base_act_free_gift_help{ type=1,cost=63,delay_day=5,reward = [{3421063,1},{3321063,1},{3521063,1},{5101402,2},{5101412,2},{5101422,2}],re_reward = [{10106, 388}],desc = ?T("至尊橙装") },
   #base_act_free_gift_help{ type=2,cost=688,delay_day=12,reward = [{1025002,3},{6609002,1},{7206001,20},{3101000,8},{3302000,2},{7207001,20}],re_reward = [{10199, 688}],desc = ?T("爱情礼包") },
   #base_act_free_gift_help{ type=3,cost=1988,delay_day=18,reward = [{6601008,1},{3301000,60},{8001203,2},{3302000,2},{3303000,3},{8001231,1}],re_reward = [{10199, 1988}],desc = ?T("绝版时装") }],
        act_info=#act_info{act_desc=?T("零元礼包测试")} };
get(2) -> #base_act_free_gift{open_info=#open_info{gp_id = [{0,60000},{30001,50000},{8001,8500},{1001,1500},{1501,2000},{2001,2500},{2501,3000},{50001,60000},{3001,3500},{3501,4000},{5001,5500},{6001,6500},{4001,4500},{8501,9000},{9001,9500},{9501,10000}],gs_id=[],open_day=1,end_day=2,start_time=0,end_time=0,limit_open_day=0,limit_end_day=0,merge_st_day=0,merge_et_day=0,merge_times_list=[],ignore_gs=[],priority=0,after_open_day=0},act_id=2,
        gift_list = [
   #base_act_free_gift_help{ type=1,cost=63,delay_day=5,reward = [{3421063,1},{3321063,1},{3521063,1},{5101402,2},{5101412,2},{5101422,2}],re_reward = [{10106, 388}],desc = ?T("至尊橙装") },
   #base_act_free_gift_help{ type=2,cost=688,delay_day=12,reward = [{1025002,3},{6609002,1},{7206001,20},{3101000,8},{3302000,2},{7207001,20}],re_reward = [{10199, 688}],desc = ?T("爱情礼包") },
   #base_act_free_gift_help{ type=3,cost=1988,delay_day=18,reward = [{6601018,1},{3301000,60},{8001203,2},{3302000,2},{3303000,3},{8001231,1}],re_reward = [{10199, 1988}],desc = ?T("绝版时装") }],
        act_info=#act_info{} };
get(_) -> [].

get_all() -> [1,2].
