%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_lv_gift
	%%% @Created : 2016-06-15 22:43:45
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_lv_gift).
-export([get/1,get_all/0]).
-include("lv_gift.hrl").
  get(10) -> 24401;
  get(27) -> 24402;
  get(39) -> 24403;
  get(42) -> 24404;
  get(47) -> 24405;
  get(51) -> 24406;
  get(61) -> 24407;
  get(71) -> 24408;
  get(81) -> 24409;
get(_) -> [].
get_all() -> [10,27,39,42,47,51,61,71,81].
