%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_guild_cmd_name
	%%% @Created : 2017-06-19 20:41:30
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_guild_cmd_name).
-export([ids/0]).
-export([get/1]).
-include("common.hrl").
-include("guild.hrl").

    ids() ->
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20].
get(1)->[?T("雄霸"),?T("伯纳尔")];
get(2)->[?T("帅气"),?T("库克")];
get(3)->[?T("帅呆"),?T("塞西尔")];
get(4)->[?T("傻傻"),?T("加里")];
get(5)->[?T("青春"),?T("布朗宁")];
get(6)->[?T("爱吃"),?T("莱斯利")];
get(7)->[?T("淡淡"),?T("乔伊斯")];
get(8)->[?T("恶魔"),?T("珀金")];
get(9)->[?T("沉默"),?T("范妮")];
get(10)->[?T("简单"),?T("斯密斯")];
get(11)->[?T("么么哒"),?T("莉娜")];
get(12)->[?T("江湖"),?T("妮可")];
get(13)->[?T("宝宝"),?T("奥丽芙")];
get(14)->[?T("流浪"),?T("苏西")];
get(15)->[?T("传说"),?T("贝蒂)")];
get(16)->[?T("帅帅帅"),?T("珍妮特")];
get(17)->[?T("善良"),?T("夏洛特")];
get(18)->[?T("皇族"),?T("易斯")];
get(19)->[?T("成功"),?T("亚当")];
get(20)->[?T("夏日"),?T("查尔斯")];
get(_) -> [].
