%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_guild_name
	%%% @Created : 2017-06-19 20:41:30
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_guild_name).
-export([ids/0]).
-export([get/1]).
-include("common.hrl").
-include("guild.hrl").

    ids() ->
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20].
get(1)->[?T("天外"),?T("组")];
get(2)->[?T("点星"),?T("帮")];
get(3)->[?T("星象"),?T("阁")];
get(4)->[?T("天命"),?T("楼")];
get(5)->[?T("青涛"),?T("教")];
get(6)->[?T("虎豹"),?T("联盟")];
get(7)->[?T("无影"),?T("寨")];
get(8)->[?T("神梦"),?T("社")];
get(9)->[?T("魔"),?T("峰")];
get(10)->[?T("圣火"),?T("国")];
get(11)->[?T("战神"),?T("会")];
get(12)->[?T("归元"),?T("门")];
get(13)->[?T("皇极"),?T("族")];
get(14)->[?T("魔光"),?T("刹")];
get(15)->[?T("异魔"),?T("派")];
get(16)->[?T("天极"),?T("圣殿")];
get(17)->[?T("魔灵"),?T("神教")];
get(18)->[?T("玄光"),?T("城")];
get(19)->[?T("屠兽"),?T("组")];
get(20)->[?T("血焰"),?T("堂")];
get(_) -> [].
