%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_equip_strength_suit
	%%% @Created : 2018-02-07 17:44:31
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_equip_strength_suit).
-export([ids/0]).
-export([max_lv/0]).
-export([get/1]).
-include("error_code.hrl").
-include("equip.hrl").

    ids() ->
    [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50].

    max_lv() ->
    50.
get(1) -> [{att,10},{def,5},{hp_lim,100}];
get(2) -> [{att,16},{def,8},{hp_lim,160}];
get(3) -> [{att,30},{def,15},{hp_lim,300}];
get(4) -> [{att,49},{def,24},{hp_lim,486}];
get(5) -> [{att,191},{def,96},{hp_lim,1906}];
get(6) -> [{att,277},{def,139},{hp_lim,2767}];
get(7) -> [{att,375},{def,188},{hp_lim,3748}];
get(8) -> [{att,485},{def,243},{hp_lim,4843}];
get(9) -> [{att,605},{def,303},{hp_lim,6045}];
get(10) -> [{att,735},{def,368},{hp_lim,7346}];
get(11) -> [{att,875},{def,438},{hp_lim,8742}];
get(12) -> [{att,1023},{def,512},{hp_lim,10225}];
get(13) -> [{att,1179},{def,590},{hp_lim,11789}];
get(14) -> [{att,1343},{def,672},{hp_lim,13427}];
get(15) -> [{att,1514},{def,757},{hp_lim,15132}];
get(16) -> [{att,1706},{def,853},{hp_lim,17052}];
get(17) -> [{att,1983},{def,992},{hp_lim,19829}];
get(18) -> [{att,2340},{def,1170},{hp_lim,23394}];
get(19) -> [{att,2854},{def,1427},{hp_lim,28538}];
get(20) -> [{att,3512},{def,1756},{hp_lim,35120}];
get(21) -> [{att,3781},{def,1891},{hp_lim,37808}];
get(22) -> [{att,4063},{def,2032},{hp_lim,40624}];
get(23) -> [{att,4357},{def,2179},{hp_lim,43568}];
get(24) -> [{att,4664},{def,2332},{hp_lim,46640}];
get(25) -> [{att,4984},{def,2492},{hp_lim,49840}];
get(26) -> [{att,5317},{def,2659},{hp_lim,53168}];
get(27) -> [{att,5663},{def,2832},{hp_lim,56624}];
get(28) -> [{att,6021},{def,3011},{hp_lim,60208}];
get(29) -> [{att,6392},{def,3196},{hp_lim,63920}];
get(30) -> [{att,6776},{def,3388},{hp_lim,67760}];
get(31) -> [{att,7115},{def,3558},{hp_lim,71148}];
get(32) -> [{att,7471},{def,3736},{hp_lim,74706}];
get(33) -> [{att,7845},{def,3923},{hp_lim,78441}];
get(34) -> [{att,8237},{def,4119},{hp_lim,82363}];
get(35) -> [{att,8649},{def,4325},{hp_lim,86481}];
get(36) -> [{att,9081},{def,4541},{hp_lim,90805}];
get(37) -> [{att,9535},{def,4768},{hp_lim,95345}];
get(38) -> [{att,10012},{def,5006},{hp_lim,100113}];
get(39) -> [{att,10512},{def,5256},{hp_lim,105118}];
get(40) -> [{att,11038},{def,5519},{hp_lim,110374}];
get(41) -> [{att,11590},{def,5795},{hp_lim,115893}];
get(42) -> [{att,12169},{def,6085},{hp_lim,121688}];
get(43) -> [{att,12778},{def,6389},{hp_lim,127772}];
get(44) -> [{att,13416},{def,6708},{hp_lim,134160}];
get(45) -> [{att,14087},{def,7044},{hp_lim,140868}];
get(46) -> [{att,14792},{def,7396},{hp_lim,147912}];
get(47) -> [{att,15531},{def,7766},{hp_lim,155308}];
get(48) -> [{att,16308},{def,8154},{hp_lim,163073}];
get(49) -> [{att,17123},{def,8562},{hp_lim,171226}];
get(50) -> [{att,17979},{def,8990},{hp_lim,179788}];
get(_) -> [].