%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_arena_score_reward
	%%% @Created : 2017-11-13 15:25:00
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_arena_score_reward).
-export([ids/0]).
-export([get/1]).
-include("common.hrl").
-include("arena.hrl").

    ids() ->
    [1,2,3,4,5,6,7].

    get(1) ->[6,[{8001054,1}]];
    get(2) ->[12,[{1010005,1}]];
    get(3) ->[18,[{8001054,1}]];
    get(4) ->[24,[{1010005,1}]];
    get(5) ->[30,[{8001054,1}]];
    get(6) ->[40,[{1010005,2}]];
    get(7) ->[60,[{8001054,2}]];get(_) -> [].