%%%---------------------------------------
	%%% @Author  : 苍狼工作室
	%%% @Module  : data_guild_notice
	%%% @Created : 2017-11-29 19:52:13
	%%% @Description:  自动生成
	%%%---------------------------------------
-module(data_guild_notice).
-export([get/1]).
-export([get_all/0]).
-include("common.hrl").
  get(1) -> ?T("温泉活动将于 ~s 开始，喜欢泡温泉的小伙伴不要错过哦！~n");
  get(2) -> ?T("双倍护送活动将于 ~s 开始，活动期间护送奖励双倍哦！~n");
  get(3) -> ?T("答题活动将于 ~s 开始，小伙伴们快来涨“姿势”！~n");
  get(4) -> ?T("六龙争霸活动将于 ~s 开始，稀有奖励唾手可得，快来参加吧！~n");
  get(5) -> ?T("王城夺宝活动将于 ~s 开始，满地都是金晃晃的宝箱哦！~n");
  get(6) -> ?T("王城守卫活动将于 ~s 开始，保家卫国，人人有责！~n");
  get(7) -> ?T("领地战活动将于 ~s 开始，攻城掠地，唯我仙盟最强大！~n");
  get(8) -> ?T("跨服攻城活动将于 ~s 开始，至高的荣耀属于那些努力的人！~n");
  get(9) -> ?T("巅峰塔活动将于 ~s 开始，谁才是真正的巅峰王者！！~n");
  get(10) -> ?T("跨服竞技活动将于 ~s 开始，快来和小伙伴一较高下吧！~n");
  get(11) -> ?T("世界首领将于 ~s 开始，打BOSS，刷装备咯！~n");
get(_) -> ?T("~s").

    get_all() ->
    [1,2,3,4,5,6,7,8,9,10,11].
