%%----------------------------------------------------
%% 判定条件的数据结构
%% @author yeahoo2000@gmail.com
%%----------------------------------------------------

%% 判定条件数据结构
%% 目标ID根据不同的条件有着不同的意义:
%% target和target_value都应该为::integer()类型
%% ------------------------------------------------------------------------
%% 代号 标签         target设置  target_value设置    说明
%% ------------------------------------------------------------------------
%%  01  get_item     物品ID      物品数量            要求获得指定的物品N个
%%  02  use_item     物品ID      物品数量            要求用掉指定的物品N个
%%  03  kill_npc     NpcId       杀死次数            要求杀死指定的NPC N次
%%  04  vip          0           0:非VIP 1:是VIP     要求VIP状态为指定状态
%%  05  get_task     0           任务ID              要求已接下指定的任务
%%  06  finish_task  任务ID      完成次数            要求完成指定的任务N次
%%  07  coin         0           金币数量            要求金币大于或等于指定值
%%  08  get_coin     0           金币数量            要求得到金币大于或等于指定值
%%  10  lev          0           等级数字            要求等级大于或等于指定值
%%  11  make_friend  0           加好友次数          要求添加N个好友
%%  12  has_friend   0           好友数量            要求有N个好友
%%  13  in_team      0           队友数量            要求当前队伍大于N个队友
%%  14  sex          0           0:女 1:男           要求为指定性别
%%  15  career       0       1:真武 2:魅影 3:天师 4:飞羽 5:天尊 6:新手    要求为指定职业
%%  16  event        event_id   0:非指定状态 1:指定状态   要求角色符合状态设置 
%%  XX  activity    0           精力值               要求精力值达到多少
%% ------------------------------------------------------------------------
-record(condition, {
         code           ::integer()     %% 代号
        ,label                          %% 标签
        ,target = 0     ::integer()     %% 目标ID
        ,target_ext = 0                 %% 目标扩展 用于特殊事件 普通事件使用不到 如将任意N个技能修炼至X级 则可用target_ext表示X
        ,target_value   ::integer()     %% 目标值
        ,msg = <<>>                     %% 判定失败时的返回消息
    }
).
