%%----------------------------------------------------
%% notice系统数据库操作
%%
%% @author yjbgwxf@gmail.com
%%----------------------------------------------------
-define(notice_top, 0).                         %% 顶部公告
-define(notice_left, 1).                        %% 左下角公告
-define(notice_top_sec, 20).                    %% 顶部公告默认20秒播一条
-define(notice_left_sec, 20).                   %% 左下角默认20秒播一条

%% prompt消息类型分类
-define(prompt_charge_open_srv, 1).

%%------------------------------------------------------------------------------------------------
%%              |   ID      |  type  |   time    |   start       |   finish      |   msg         |
%%-----------------------------------------------------------------------------------------------
%% 顶部轮播公告 |  公告ID   |   0    | 间隔时间  |  开始时间     |   结束时间    |   公告内容    |
%%-----------------------------------------------------------------------------------------------
%% 左下轮播公告 |  公告ID   |   1    | 间隔时间  |  开始时间     |   结束时间    |   公告内容    |
%%-----------------------------------------------------------------------------------------------

-record(notice, {
        id = 0                                  %% 公告ID
        ,type = 0                               %% 公告类型，见上
        ,start = 0                              %% 开始时间
        ,finish = 0                             %% 结束时间
        ,msg = <<>>                             %% 公告内容
    }
).

-record(notice_board, {
        id = 0                                  %% 公共公告ID
        ,stime = 0                              %% 公告开始时间
        ,time = 0                         	    %% 有效截止时间
        ,gold = 0                               %% 晶钻数
        ,coin = 0                               %% 金币数
        ,bind_gold = 0                          %% 绑定晶钻数
        ,bind_coin = 0                          %% 绑定金币数
        ,items = []                             %% 物品数 [{item_id, bind_type, item_num}|...]
        ,subject = <<>>                         %% 公告主题
        ,summary = <<>>                         %% 简要内容
        ,text = <<>>                            %% 内容
        ,condition = []                         %% 公告对象限制限制条件
    }
).
-record(notice_state, {
        top_gap = ?notice_top_sec
        ,top = []                               %% 顶部定时公告
        ,left_gap = ?notice_left_sec
        ,left = []                              %% 左下角轮播公告
        ,boards = []                            %% 通用公告板内容
        ,future_boards = []                     %% 通用公告板内容  未来的
    }
).

-record(notice_said, {
        id = 0                                  %% 传闻ID
        ,times = 0                              %% 次数
        ,content = <<>>                         %% 内容
        ,times_cur = 0                          %% 当前播放的次数
    }
).