%%----------------------------------------------------
%% 位置信息数据结构定义
%% 
%% @author yeahoo2000@gmail.com
%%----------------------------------------------------

-record(pos, {
        map = 0             %% 当前所在地图id
        ,last = {0, 0, 0}   %% 最后所在的位置(进入特殊场景前一刻所在的位置){地图ID, X坐标, Y坐标}
        ,map_base_id = 0    %% 所在地图的base_id
        ,map_pid = 0        %% 当前地图PID
        ,hidden = 0         %% 是否隐藏状态(0:显示 1:隐藏)
        ,x = 0              %% 当前x坐标
        ,y = 0              %% 当前y坐标
        ,dest_x = 0         %% 前往目标点x坐标
        ,dest_y = 0         %% 前往目标点y坐标
        ,dir = 0            %% 角色面对的方向
        ,line = 1           %% 所在线路，只有换线才能修改这个值，切场景不需要改
        ,town_map_pid       %% 所在主城pid
    }
).
