%%----------------------------------------------------
%% 数值比率控制数据结构定义
%% 
%% @author yeahoo2000@gmail.com
%%----------------------------------------------------

%% 数值比率控制，以下值单位都是:%
%% 各附加比率直接加上100

-record(ratio, {
         exp = 100          %% 经验加成
        %%-----------------------------
        ,js = 100
        ,dmg = 100          %% 攻击加成
        ,hp_max = 100       %% 血量上限
        ,mp_max = 100       %% 法力上限
        ,defence = 100      %% 防御加成
        ,hitrate = 100      %% 命中加成
        ,evasion = 100      %% 躲闪
        ,critrate = 100     %% 暴击
        ,tenacity = 100     %% 坚韧
        ,dmg_magic = 100    %% 绝对伤害加成

        ,resist_metal = 100 %% 金抗性
        ,resist_wood = 100  %% 木抗性
        ,resist_water = 100 %% 水抗性
        ,resist_fire = 100  %% 火抗性
        ,resist_earth = 100 %% 土抗性
        ,anti_stun = 100    %% 抗晕
        ,anti_taunt = 100   %% 抗嘲讽
        ,anti_silent = 100  %% 抗沉默/遗忘
        ,anti_sleep = 100   %% 抗睡眠
        ,anti_stone = 100   %% 抗石化
        ,anti_poison = 100  %% 抗毒
        ,anti_seal = 100    %% 抗封印
        %%-----------------------------
        ,coin = 100         %% 金币折扣(花钱时起作用)
        ,coin_get = 100     %% 金币加成(得到金币时起作用)
        ,gold = 100         %% 元宝折扣
        ,speed = 100        %% 移动速度加成
        ,psychic = 100      %% 灵力加成
        ,dmg_correct = 100  %% 伤害修正值，100以上伤害加深，100以下伤害减免
        ,drop = 100         %% 掉落概率加成 100为不变
        ,sit_hp = 100       %% 打坐回血加成
        ,sit_mp = 100       %% 打坐回蓝加成
        ,sit_exp = 100      %% 打坐加经验
        ,sit_psychic = 100  %% 打坐加灵力
    }
).
