%%----------------------------------------------------
%% 开服7天签到数据相关 
%% @author lishen@jieyou.cn
%%----------------------------------------------------
-module(signin_data).
-export([
        get_srv_open_7_award/1
    ]).

get_srv_open_7_award(1) -> [{25021,3},{30011,3}];
get_srv_open_7_award(2) -> [{25021,5},{23002,5}];
get_srv_open_7_award(3) -> [{22201,4},{23001,3}];
get_srv_open_7_award(4) -> [{21011,2},{32000,5},{21020,2}];
get_srv_open_7_award(5) -> [{21012,2},{30011,10},{21020,2}];
get_srv_open_7_award(6) -> [{32001,2},{23003,2},{23006,5}];
get_srv_open_7_award(7) -> [{25022,1},{21020,4},{33051,1}];
get_srv_open_7_award(_) -> [].
