%%----------------------------------------------------
%% 通讯协议编码、解码处理
%% author by 苍狼工作室
%% createtime 2017-02-27 19:59:26
%%----------------------------------------------------
-module(pt_124).
-export([read/2, write/2]).

-include("common.hrl").
-compile(export_all).

err(0) ->"失败"; 
err(1) ->"成功"; 
err(2) ->"不在监狱中"; 
err(3) ->"必须清除杀戮值才能退出"; 
err(4) ->"没有杀戮值,无需洗净"; 
err(5) ->"钻石不足以支付洗净"; 
err(6) ->"当前已有恶狗，等消失后在召唤"; 
err(7) ->"钻石不足以支付放狗"; 
err(8) ->"您不再监狱中"; 
err(9) ->"钻石不足以支付贿赂"; 
err(10) ->"守卫贪心不足,收钱不办事"; 
err(11) ->"没有杀戮值"; 
err(_) ->"未定义错误" .

%%----------------------------------------------------
%% 解包命令
%%----------------------------------------------------

read(12401, _B0) ->
    {ok, {}};

read(12402, _B0) ->
    {ok, {}};

read(12403, _B0) ->
    {ok, {}};

read(12404, _B0) ->
    {ok, {}};

read(_Cmd, _Bin) ->
    {error, {unknown_command, _Cmd}}.

%%----------------------------------------------------
%% 打包命令
%%----------------------------------------------------

%% 请求退出监狱 
write(12401, {P0_code}) ->
    D_a_t_a = <<P0_code:8/signed>>,
    {ok, <<(byte_size(D_a_t_a) + 7):32, 12401:16,0:8, D_a_t_a/binary>>};


%% 洗净罪恶 
write(12402, {P0_code}) ->
    D_a_t_a = <<P0_code:8/signed>>,
    {ok, <<(byte_size(D_a_t_a) + 7):32, 12402:16,0:8, D_a_t_a/binary>>};


%% 放狗 
write(12403, {P0_code}) ->
    D_a_t_a = <<P0_code:8/signed>>,
    {ok, <<(byte_size(D_a_t_a) + 7):32, 12403:16,0:8, D_a_t_a/binary>>};


%% 贿赂 
write(12404, {P0_code}) ->
    D_a_t_a = <<P0_code:8/signed>>,
    {ok, <<(byte_size(D_a_t_a) + 7):32, 12404:16,0:8, D_a_t_a/binary>>};


write(_Cmd, _Data) ->
    {error, {unknown_command, _Cmd}}.


%% --------------------------------------------------
%% 二进制函数
%% --------------------------------------------------



